// Хардкод даты, вместо того, что забирается с API
export const tableRows = [
  { id: 1, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка'},
  { id: 2, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка с маком'},
  { id: 3, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка с повидлом'},
  { id: 4, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка Московская'},
  { id: 5, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка с изюмом'},
  { id: 6, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка Свердловская'},
  { id: 7, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка со сгущенкой'},
  { id: 8, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Булочки', c5: 'Булочка с творогом'},
  { id: 9, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Слойки', c5: 'Слойка с ветчиной'},
  { id: 10, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Слойки', c5: 'Слойка с сыром'},
  { id: 11, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Слойки', c5: 'Слойка с джемом'},
  { id: 12, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Слойки', c5: 'Хачапури'},
  { id: 13, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Жареная выпечка', c5: 'Беляш'},
  { id: 14, c1: 'Реутов, Юбилейный 2А', c2: 'Мучное изделие', c3: 'Штучная продукция', c4: 'Жареная выпечка', c5: 'Чебурек'},
  { id: 15, c1: 'Реутов, Юбилейный 2А', c2: 'Овощи', c3: 'Весовая продукция', c4: 'Капуста', c5: 'Брокколи'},
];

export const tableColumns = [
  { field: 'c1', headerName: 'ТК', width: 308, headerClassName: 'header'},
  { field: 'c2', headerName: 'Группа', width: 310, headerClassName: 'header' },
  { field: 'c3', headerName: 'Категория', width: 310, headerClassName: 'header' },
  { field: 'c4', headerName: 'Подкатегория', width: 310, headerClassName: 'header' },
  { field: 'c5', headerName: 'Товар', width: 310, headerClassName: 'header' }
];
